Revit 2024 API
DirectShapeType.AddReferencePlane Method (Plane, BoundingBoxUV, DirectShapeReferenceOptions)
 Adds a reference plane to the DirectShapeType. The reference plane can either be bounded or unbounded.
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)
Since: 2022
Syntax
C#
public void AddReferencePlane(
	Plane refPlane,
	BoundingBoxUV boundingBoxUV,
	DirectShapeReferenceOptions options
)
Visual Basic
Public Sub AddReferencePlane ( _
	refPlane As Plane, _
	boundingBoxUV As BoundingBoxUV, _
	options As DirectShapeReferenceOptions _
)
Visual C++
public:
void AddReferencePlane(
	Plane^ refPlane,
	BoundingBoxUV^ boundingBoxUV,
	DirectShapeReferenceOptions^ options
)
Parameters
refPlane
Type: Autodesk.Revit.DB.Plane
 The geometry of the new reference plane.
boundingBoxUV
Type: Autodesk.Revit.DB.BoundingBoxUV
 If boundingBoxUV is set, the resulting reference plane that is added to the DirectShapeType will be displayed with those bounds. Note that the specified bounds must not be degenerate. If boundingBoxUV is not set, reasonable bounds are automatically calculated and applied to the input plane. The automatic bounds are based on the host direct shape's geometry.
options
Type: Autodesk.Revit.DB.DirectShapeReferenceOptions
 The options that are used to configure the new reference plane.
Exceptions
Exception | Condition
Autodesk.Revit.Exceptions.ArgumentException |  boundingBoxUV cannot be used as a BoundingBoxUV for the reference plane surface. -or- options cannot be used to add a reference object to this DirectShapeType.
Autodesk.Revit.Exceptions.ArgumentNullException |  A non-optional argument was null
See Also
DirectShapeType Class
AddReferencePlane Overload
Autodesk.Revit.DB Namespace